WuCS-23to24/ESP32_Sensor_Node/include/u-blox_structs.h
            uint32_t tAcc : 1;
            uint32_t nano : 1;
            uint32_t fixType : 1;
            uint32_t gnssFixOK : 1;
            uint32_t diffSoln : 1;
            uint32_t psmState : 1;
            uint32_t headVehValid : 1;
            uint32_t carrSoln : 1;

            uint32_t confirmedAvai : 1;
            uint32_t confirmedDate : 1;
            uint32_t confirmedTime : 1;

            uint32_t numSV : 1;
            uint32_t lon : 1;
            uint32_t lat : 1;
            uint32_t height : 1;
            uint32_t hMSL : 1;
            uint32_t hAcc : 1;
            uint32_t vAcc : 1;
            uint32_t velN : 1;
            uint32_t velE : 1;
        } bits;
    } moduleQueried1;
    union {
        uint32_t all;
        struct
        {
            uint32_t velD : 1;
            uint32_t gSpeed : 1;
            uint32_t headMot : 1;
            uint32_t sAcc : 1;
            uint32_t headAcc : 1;
            uint32_t pDOP : 1;

            uint32_t invalidLlh : 1;

            uint32_t headVeh : 1;
            uint32_t magDec : 1;
            uint32_t magAcc : 1;
        } bits;
    } moduleQueried2;
} UBX_NAV_PVT_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_NAV_PVT_data_t data;
    UBX_NAV_PVT_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_NAV_PVT_data_t *);
    UBX_NAV_PVT_data_t *callbackData;
} UBX_NAV_PVT_t;

// UBX-NAV-ODO (0x01 0x09): Odometer solution
const uint16_t UBX_NAV_ODO_LEN = 20;

typedef struct
{
    uint8_t version; // Message version (0x00 for this version)
    uint8_t reserved1[3];
    uint32_t iTOW;          // GPS time of week of the navigation epoch: ms
    uint32_t distance;      // Ground distance since last reset: m
    uint32_t totalDistance; // Total cumulative ground distance: m
    uint32_t distanceStd;   // Ground distance accuracy (1-sigma): m
} UBX_NAV_ODO_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

            uint32_t version : 1;
            uint32_t iTOW : 1;
            uint32_t distance : 1;
            uint32_t totalDistance : 1;
            uint32_t distanceStd : 1;
        } bits;
    } moduleQueried;
} UBX_NAV_ODO_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_NAV_ODO_data_t data;
    UBX_NAV_ODO_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_NAV_ODO_data_t *);
    UBX_NAV_ODO_data_t *callbackData;
} UBX_NAV_ODO_t;

// UBX-NAV-VELECEF (0x01 0x11): Velocity solution in ECEF
const uint16_t UBX_NAV_VELECEF_LEN = 20;

typedef struct
{
    uint32_t iTOW;  // GPS time of week of the navigation epoch: ms
    int32_t ecefVX; // ECEF X velocity: cm/s
    int32_t ecefVY; // ECEF Y velocity: cm/s
    int32_t ecefVZ; // ECEF Z velocity: cm/s
    uint32_t sAcc;  // Speed accuracy estimate: cm/s
} UBX_NAV_VELECEF_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

            uint32_t iTOW : 1;
            uint32_t ecefVX : 1;
            uint32_t ecefVY : 1;
            uint32_t ecefVZ : 1;
            uint32_t sAcc : 1;
        } bits;
    } moduleQueried;
} UBX_NAV_VELECEF_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_NAV_VELECEF_data_t data;
    UBX_NAV_VELECEF_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_NAV_VELECEF_data_t *);
    UBX_NAV_VELECEF_data_t *callbackData;
} UBX_NAV_VELECEF_t;

// UBX-NAV-VELNED (0x01 0x12): Velocity solution in NED frame
const uint16_t UBX_NAV_VELNED_LEN = 36;

typedef struct
{
    uint32_t iTOW;   // GPS time of week of the navigation epoch: ms
    int32_t velN;    // North velocity component: cm/s
    int32_t velE;    // East velocity component: cm/s
    int32_t velD;    // Down velocity component: cm/s
    uint32_t speed;  // Speed (3-D): cm/s
    uint32_t gSpeed; // Ground Speed (2-D): cm/s
    int32_t heading; // Heading of motion 2-D: Degrees * 1e-5
    uint32_t sAcc;   // Speed accuracy estimate: cm/s
    uint32_t cAcc;   // Course/Heading accuracy estimate: Degrees * 1e-5
} UBX_NAV_VELNED_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

            uint32_t iTOW : 1;
            uint32_t velN : 1;
            uint32_t velE : 1;
            uint32_t velD : 1;
            uint32_t speed : 1;
            uint32_t gSpeed : 1;
            uint32_t heading : 1;
            uint32_t sAcc : 1;
            uint32_t cAcc : 1;
        } bits;
    } moduleQueried;
} UBX_NAV_VELNED_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_NAV_VELNED_data_t data;
    UBX_NAV_VELNED_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_NAV_VELNED_data_t *);
    UBX_NAV_VELNED_data_t *callbackData;
} UBX_NAV_VELNED_t;

// UBX-NAV-HPPOSECEF (0x01 0x13): High precision position solution in ECEF
const uint16_t UBX_NAV_HPPOSECEF_LEN = 28;

typedef struct
{
    uint8_t version; // Message version (0x00 for this version)
    uint8_t reserved1[3];
    uint32_t iTOW;  // GPS time of week of the navigation epoch: ms
    int32_t ecefX;  // ECEF X coordinate: cm
    int32_t ecefY;  // ECEF Y coordinate: cm
    int32_t ecefZ;  // ECEF Z coordinate: cm
    int8_t ecefXHp; // High precision component of ECEF X coordinate: mm * 0.1
    int8_t ecefYHp; // High precision component of ECEF Y coordinate: mm * 0.1
    int8_t ecefZHp; // High precision component of ECEF Z coordinate: mm * 0.1
    union {
        uint8_t all;
        struct
        {
            uint8_t invalidEcef : 1; // 1 = Invalid ecefX, ecefY, ecefZ, ecefXHp, ecefYHp and ecefZHp
        } bits;
    } flags;
    uint32_t pAcc; // Position Accuracy Estimate: mm * 0.1
} UBX_NAV_HPPOSECEF_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

            uint32_t version : 1;
            uint32_t iTOW : 1;
            uint32_t ecefX : 1;
            uint32_t ecefY : 1;
            uint32_t ecefZ : 1;
            uint32_t ecefXHp : 1;
            uint32_t ecefYHp : 1;
            uint32_t ecefZHp : 1;

