WuCS-23to24/ESP32_Sensor_Node/include/u-blox_structs.h
            uint32_t year : 1;
            uint32_t month : 1;
            uint32_t day : 1;
            uint32_t hour : 1;
            uint32_t min : 1;
            uint32_t sec : 1;

            uint32_t tAcc : 1;
            uint32_t nano : 1;
            uint32_t fixType : 1;

            uint32_t gnssFixOK : 1;
            uint32_t diffSoln : 1;
            uint32_t vehRollValid : 1;
            uint32_t vehPitchValid : 1;
            uint32_t vehHeadingValid : 1;
            uint32_t carrSoln : 1;

            uint32_t confirmedAvai : 1;
            uint32_t confirmedDate : 1;
            uint32_t confirmedTime : 1;

            uint32_t numSV : 1;
            uint32_t lon : 1;
            uint32_t lat : 1;
            uint32_t height : 1;
            uint32_t hMSL : 1;
            uint32_t hAcc : 1;
            uint32_t vAcc : 1;
        } bits;
    } moduleQueried1;
    union {
        uint32_t all;
        struct
        {
            uint32_t velN : 1;
            uint32_t velE : 1;
            uint32_t velD : 1;
            uint32_t gSpeed : 1;
            uint32_t sAcc : 1;
            uint32_t vehRoll : 1;
            uint32_t vehPitch : 1;
            uint32_t vehHeading : 1;
            uint32_t motHeading : 1;
            uint32_t accRoll : 1;
            uint32_t accPitch : 1;
            uint32_t accHeading : 1;
            uint32_t magDec : 1;
            uint32_t magAcc : 1;
            uint32_t errEllipseOrient : 1;
            uint32_t errEllipseMajor : 1;
            uint32_t errEllipseMinor : 1;
        } bits;
    } moduleQueried2;
} UBX_NAV_PVAT_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_NAV_PVAT_data_t data;
    UBX_NAV_PVAT_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_NAV_PVAT_data_t *);
    UBX_NAV_PVAT_data_t *callbackData;
} UBX_NAV_PVAT_t;

// UBX-NAV-TIMEUTC (0x01 0x21): UTC time solution
const uint16_t UBX_NAV_TIMEUTC_LEN = 20;

typedef struct
{
    uint32_t iTOW; // GPS time of week of the navigation epoch: ms
    uint32_t tAcc; // Time accuracy estimate (UTC): ns
    int32_t nano;  // Fraction of second, range -1e9 .. 1e9 (UTC): ns
    uint16_t year; // Year (UTC)
    uint8_t month; // Month, range 1..12 (UTC)
    uint8_t day;   // Day of month, range 1..31 (UTC)
    uint8_t hour;  // Hour of day, range 0..23 (UTC)
    uint8_t min;   // Minute of hour, range 0..59 (UTC)
    uint8_t sec;   // Seconds of minute, range 0..60 (UTC)
    union {
        uint8_t all;
        struct
        {
            uint8_t validTOW : 1; // 1 = Valid Time of Week
            uint8_t validWKN : 1; // 1 = Valid Week Number
            uint8_t validUTC : 1; // 1 = Valid UTC Time
            uint8_t reserved : 1;
            uint8_t utcStandard : 4; // UTC standard identifier
        } bits;
    } valid;
} UBX_NAV_TIMEUTC_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

            uint32_t iTOW : 1;
            uint32_t tAcc : 1;
            uint32_t nano : 1;
            uint32_t year : 1;
            uint32_t month : 1;
            uint32_t day : 1;
            uint32_t hour : 1;
            uint32_t min : 1;
            uint32_t sec : 1;

            uint32_t validTOW : 1;
            uint32_t validWKN : 1;
            uint32_t validUTC : 1;
            uint32_t utcStandard : 1;
        } bits;
    } moduleQueried;
} UBX_NAV_TIMEUTC_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_NAV_TIMEUTC_data_t data;
    UBX_NAV_TIMEUTC_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_NAV_TIMEUTC_data_t *);
    UBX_NAV_TIMEUTC_data_t *callbackData;
} UBX_NAV_TIMEUTC_t;

// UBX-NAV-CLOCK (0x01 0x22): Clock solution
const uint16_t UBX_NAV_CLOCK_LEN = 20;

typedef struct
{
    uint32_t iTOW; // GPS time of week of the navigation epoch: ms
    int32_t clkB;  // Clock bias: ns
    int32_t clkD;  // Clock drift: ns/s
    uint32_t tAcc; // Time accuracy estimate: ns
    uint32_t fAcc; // Frequency accuracy estimate: ps/s
} UBX_NAV_CLOCK_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

            uint32_t iTOW : 1;
            uint32_t clkB : 1;
            uint32_t clkD : 1;
            uint32_t tAcc : 1;
            uint32_t fAcc : 1;
        } bits;
    } moduleQueried;
} UBX_NAV_CLOCK_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_NAV_CLOCK_data_t data;
    UBX_NAV_CLOCK_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_NAV_CLOCK_data_t *);
    UBX_NAV_CLOCK_data_t *callbackData;
} UBX_NAV_CLOCK_t;

// UBX-NAV-TIMELS (0x01 0x26): Leap second event information
const uint16_t UBX_NAV_TIMELS_LEN = 24;

typedef struct
{
    uint32_t iTOW;   // GPS time of week of the navigation epoch: ms
    uint8_t version; // Message version (0x00 for this version)
    uint8_t reserved1[3];
    uint8_t srcOfCurrLs;    // Information source for the current number of leap seconds
    int8_t currLs;          // Current number of leap seconds since start of GPS (Jan 6, 1980), s
    uint8_t srcOfLsChange;  // Information source for the future leap second event
    int8_t lsChange;        // Future leap second change if one is scheduled, +1, 0, -1s
    int32_t timeToLsEvent;  // Num of secs until the next or from the last leap second, s
    uint16_t dateOfLsGpsWn; // GPS week num (WN) of the next or the last leap second event
    uint16_t dateOfLsGpsDn; // GPS day of week num (DN) for the next or last leap second event
    uint8_t reserved2[3];
    union {
        uint8_t all;
        struct
        {
            uint8_t validCurrLs : 1;        // 1 = Valid current number of leap seconds value
            uint8_t validTimeToLsEvent : 1; // 1 = Valid time to next leap second event or from the last leap second
                                            // event if no future event scheduled
        } bits;
    } valid;
} UBX_NAV_TIMELS_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

            uint32_t iTOW : 1;
            uint32_t version : 1;
            uint32_t srcOfCurrLs : 1;
            uint32_t currLs : 1;
            uint32_t srcOfLsChange : 1;
            uint32_t lsChange : 1;
            uint32_t timeToLsEvent : 1;
            uint32_t dateOfLsGpsWn : 1;
            uint32_t dateOfLsGpsDn : 1;
            uint32_t validCurrLs : 1;
            uint32_t validTimeToLsEvent : 1;
        } bits;
    } moduleQueried;
} UBX_NAV_TIMELS_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_NAV_TIMELS_data_t data;
    UBX_NAV_TIMELS_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_NAV_TIMELS_data_t *);
    UBX_NAV_TIMELS_data_t *callbackData;
} UBX_NAV_TIMELS_t;

// UBX-NAV-SAT (0x01 0x35): Satellite Information
const uint16_t UBX_NAV_SAT_MAX_BLOCKS = 255; // numSvs is 8-bit
const uint16_t UBX_NAV_SAT_MAX_LEN = 8 + (12 * UBX_NAV_SAT_MAX_BLOCKS);

typedef struct
{
    uint32_t iTOW;   // GPS time of week
    uint8_t version; // Message version (0x01 for this version)
    uint8_t numSvs;  // Number of satellites
    uint8_t reserved1[2];
} UBX_NAV_SAT_header_t;

typedef struct
{
    uint8_t gnssId; // GNSS identifier
    uint8_t svId;   // Satellite identifier
    uint8_t cno;    // Carrier-to-noise density ratio: dB-Hz
    int8_t elev;    // Elevation (range: +/-90): deg
    int16_t azim;   // Azimuth (range 0-360): deg
    int16_t prRes;  // Pseudorange residual: m * 0.1
    union {
        uint32_t all;
        struct
        {
            uint32_t qualityInd : 3; // Signal quality indicator: 0: no signal
                                     // 1: searching signal
                                     // 2: signal acquired
                                     // 3: signal detected but unusable
                                     // 4: code locked and time synchronized
                                     // 5, 6, 7: code and carrier locked and time synchronized
            uint32_t svUsed : 1; // 1 = Signal in the subset specified in Signal Identifiers is currently being used for
                                 // navigation
            uint32_t health : 2; // Signal health flag: 0: unknown  1: healthy  2: unhealthy
            uint32_t diffCorr : 1;    // 1 = differential correction data is available for this SV
            uint32_t smoothed : 1;    // 1 = carrier smoothed pseudorange used
            uint32_t orbitSource : 3; // Orbit source: 0: no orbit information is available for this SV
                                      // 1: ephemeris is used
                                      // 2: almanac is used
                                      // 3: AssistNow Offline orbit is used
                                      // 4: AssistNow Autonomous orbit is used
                                      // 5, 6, 7: other orbit information is used
            uint32_t ephAvail : 1;    // 1 = ephemeris is available for this SV
            uint32_t almAvail : 1;    // 1 = almanac is available for this SV
            uint32_t anoAvail : 1;    // 1 = AssistNow Offline data is available for this SV
            uint32_t aopAvail : 1;    // 1 = AssistNow Autonomous data is available for this SV
            uint32_t reserved1 : 1;
            uint32_t sbasCorrUsed : 1; // 1 = SBAS corrections have been used for a signal in the subset specified in
                                       // Signal Identifiers
            uint32_t rtcmCorrUsed : 1; // 1 = RTCM corrections have been used for a signal in the subset specified in
                                       // Signal Identifiers
            uint32_t slasCorrUsed : 1; // 1 = QZSS SLAS corrections have been used for a signal in the subset specified
                                       // in Signal Identifiers
            uint32_t spartnCorrUsed : 1; // 1 = SPARTN corrections have been used for a signal in the subset specified
                                         // in Signal Identifiers
            uint32_t prCorrUsed : 1; // 1 = Pseudorange corrections have been used for a signal in the subset specified
                                     // in Signal Identifiers
            uint32_t crCorrUsed : 1; // 1 = Carrier range corrections have been used for a signal in the subset
                                     // specified in Signal Identifiers
            uint32_t doCorrUsed : 1; // 1 = Range rate (Doppler) corrections have been used for a signal in the subset
                                     // specified in Signal Identifiers
            uint32_t reserved2 : 9;
        } bits;
    } flags;
} UBX_NAV_SAT_block_t;

typedef struct
{
    UBX_NAV_SAT_header_t header;
    UBX_NAV_SAT_block_t blocks[UBX_NAV_SAT_MAX_BLOCKS];
} UBX_NAV_SAT_data_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_NAV_SAT_data_t data;
    bool moduleQueried;
    void (*callbackPointerPtr)(UBX_NAV_SAT_data_t *);
    UBX_NAV_SAT_data_t *callbackData;
} UBX_NAV_SAT_t;

// UBX-NAV-SIG (0x01 0x43): Signal information
// Note: length is variable
const uint8_t UBX_NAV_SIG_MAX_BLOCKS = 92;
const uint16_t UBX_NAV_SIG_MAX_LEN = 8 + (16 * UBX_NAV_SIG_MAX_BLOCKS);

typedef struct
{
    uint32_t iTOW;   // GPS time of week
    uint8_t version; // Message version (0x00 for this version)
    uint8_t numSigs; // Number of signals
    uint8_t reserved0[2];
} UBX_NAV_SIG_header_t;

typedef struct
{
    uint8_t gnssId;     // GNSS identifier
    uint8_t svId;       // Satellite identifier
    uint8_t sigId;      // New signal identifier
    uint8_t freqId;     // GLONASS frequency slot
    int16_t prRes;      // Pseudorange residual: m * 0.1
    uint8_t cno;        // Carrier-to-noise density ratio: dB-Hz
    uint8_t qualityInd; // Signal quality indicator:
                        // 0 = no signal
                        // 1 = searching signal
                        // 2 = signal acquired
                        // 3 = signal detected but unusable
                        // 4 = code locked and time synchronized
                        // 5, 6, 7 = code and carrier locked and timesynchronized
    uint8_t corrSource; // Correction source:
                        // 0 = no corrections
                        // 1 = SBAS corrections
                        // 2 = BeiDou corrections
                        // 3 = RTCM2 corrections
                        // 4 = RTCM3 OSR corrections
                        // 5 = RTCM3 SSR corrections
                        // 6 = QZSS SLAS corrections
                        // 7 = SPARTN corrections
                        // 8 = CLAS corrections
    uint8_t ionoModel;  // Ionospheric model used:
                        // 0 = no model
                        // 1 = Klobuchar model transmitted by GPS
                        // 2 = SBAS model
                        // 3 = Klobuchar model transmitted by BeiDou
                        // 8 = Iono delay derived from dual frequency observations
    union {
        uint16_t all;
        struct
        {
            uint16_t health : 1;     // Signal health flag: 0 = unknown; 1 = healthy; 2 = unhealthy
            uint16_t prSmoothed : 1; // 1 = Pseudorange has been smoothed
            uint16_t prUsed : 1;     // 1 = Pseudorange has been used for this signal
            uint16_t crUsed : 1;     // 1 = Carrier range has been used for this signal
            uint16_t doUsed : 1;     // 1 = Range rate (Doppler) has been used for this signal
            uint16_t prCorrUsed : 1; // 1 = Pseudorange corrections have been used for this signal
            uint16_t crCorrUsed : 1; // 1 = Carrier range corrections have been used for this signal
            uint16_t doCorrUsed : 1; // 1 = Range rate (Doppler) corrections have been usedfor this signal
            uint16_t authStatus : 1; // Authentication status of the navigation data: 0 = Unknown; 1 = Authenticated
        } bits;
    } sigFlags;
    uint8_t reserved1[4];
} UBX_NAV_SIG_block_t;

typedef struct
{
    UBX_NAV_SIG_header_t header;
    UBX_NAV_SIG_block_t blocks[UBX_NAV_SIG_MAX_BLOCKS];
} UBX_NAV_SIG_data_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_NAV_SIG_data_t data;
    bool moduleQueried;
    void (*callbackPointerPtr)(UBX_NAV_SIG_data_t *);
    UBX_NAV_SIG_data_t *callbackData;
} UBX_NAV_SIG_t;

