WuCS-23to24/ESP32_Sensor_Node/include/u-blox_structs.h
// UBX-NAV-SVIN (0x01 0x3B): Survey-in data
const uint16_t UBX_NAV_SVIN_LEN = 40;

typedef struct
{
    uint8_t version; // Message version (0x00 for this version)
    uint8_t reserved1[3];
    uint32_t iTOW;  // GPS time of week of the navigation epoch: ms
    uint32_t dur;   // Passed survey-in observation time: s
    int32_t meanX;  // Current survey-in mean position ECEF X coordinate: cm
    int32_t meanY;  // Current survey-in mean position ECEF Y coordinate: cm
    int32_t meanZ;  // Current survey-in mean position ECEF Z coordinate: cm
    int8_t meanXHP; // Current high-precision survey-in mean position ECEF X coordinate: mm * 0.1
    int8_t meanYHP; // Current high-precision survey-in mean position ECEF Y coordinate: mm * 0.1
    int8_t meanZHP; // Current high-precision survey-in mean position ECEF Z coordinate: mm * 0.1
    uint8_t reserved2;
    uint32_t meanAcc; // Current survey-in mean position accuracy: mm * 0.1
    uint32_t obs;     // Number of position observations used during survey-in
    int8_t valid;     // Survey-in position validity flag, 1 = valid, otherwise 0
    int8_t active;    // Survey-in in progress flag, 1 = in-progress, otherwise 0
    uint8_t reserved3[2];
} UBX_NAV_SVIN_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

            uint32_t version : 1;
            uint32_t iTOW : 1;
            uint32_t dur : 1;
            uint32_t meanX : 1;
            uint32_t meanY : 1;
            uint32_t meanZ : 1;
            uint32_t meanXHP : 1;
            uint32_t meanYHP : 1;
            uint32_t meanZHP : 1;
            uint32_t meanAcc : 1;
            uint32_t obs : 1;
            uint32_t valid : 1;
            uint32_t active : 1;
        } bits;
    } moduleQueried;
} UBX_NAV_SVIN_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_NAV_SVIN_data_t data;
    UBX_NAV_SVIN_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_NAV_SVIN_data_t *);
    UBX_NAV_SVIN_data_t *callbackData;
} UBX_NAV_SVIN_t;

// UBX-NAV-RELPOSNED (0x01 0x3C): Relative positioning information in NED frame
// Note:
//  RELPOSNED on the M8 is only 40 bytes long
//  RELPOSNED on the F9 is 64 bytes long and contains much more information
const uint16_t UBX_NAV_RELPOSNED_LEN = 40;
const uint16_t UBX_NAV_RELPOSNED_LEN_F9 = 64;

typedef struct
{
    uint8_t version; // Message version (0x00 for this version)
    uint8_t reserved0;
    uint16_t refStationId; // Reference Station ID
    uint32_t iTOW;         // GPS time of week of the navigation epoch: ms
    int32_t relPosN;       // North component of relative position vector: cm
    int32_t relPosE;       // East component of relative position vector: cm
    int32_t relPosD;       // Down component of relative position vector: cm
    int32_t relPosLength;  // Length of the relative position vector: cm
    int32_t relPosHeading; // Heading of the relative position vector: Degrees * 1e-5
    uint8_t reserved1[4];
    int8_t relPosHPN;      // High-precision North component of relative position vector: mm * 0.1
    int8_t relPosHPE;      // High-precision East component of relative position vector: mm * 0.1
    int8_t relPosHPD;      // High-precision Down component of relative position vector: mm * 0.1
    int8_t relPosHPLength; // High-precision component of the length of the relative position vector: mm * 0.1
    uint32_t accN;         // Accuracy of relative position North component: mm * 0.1
    uint32_t accE;         // Accuracy of relative position East component: mm * 0.1
    uint32_t accD;         // Accuracy of relative position Down component: mm * 0.1
    uint32_t accLength;    // Accuracy of length of the relative position vector: mm * 0.1
    uint32_t accHeading;   // Accuracy of heading of the relative position vector: Degrees * 1e-5
    uint8_t reserved2[4];
    union {
        uint32_t all;
        struct
        {
            uint32_t gnssFixOK : 1;   // A valid fix (i.e within DOP & accuracy masks)
            uint32_t diffSoln : 1;    // 1 if differential corrections were applied
            uint32_t relPosValid : 1; // 1 if relative position components and accuracies are valid
            uint32_t carrSoln : 2;    // Carrier phase range solution status:
                                      // 0 = no carrier phase range solution
                                      // 1 = carrier phase range solution with floating ambiguities
                                      // 2 = carrier phase range solution with fixed ambiguities
            uint32_t isMoving : 1;    // 1 if the receiver is operating in moving baseline mode
            uint32_t refPosMiss : 1;  // 1 if extrapolated reference position was used to compute moving baseline
                                      // solution this epoch
            uint32_t refObsMiss : 1;  // 1 if extrapolated reference observations were used to compute moving baseline
                                      // solution this epoch
            uint32_t relPosHeadingValid : 1; // 1 if relPosHeading is valid
            uint32_t relPosNormalized : 1;   // 1 if the components of the relative position vector (including the
                                             // high-precision parts) are normalized
        } bits;
    } flags;
} UBX_NAV_RELPOSNED_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

            uint32_t version : 1;
            uint32_t refStationId : 1;
            uint32_t iTOW : 1;
            uint32_t relPosN : 1;
            uint32_t relPosE : 1;
            uint32_t relPosD : 1;
            uint32_t relPosLength : 1;
            uint32_t relPosHeading : 1;
            uint32_t relPosHPN : 1;
            uint32_t relPosHPE : 1;
            uint32_t relPosHPD : 1;
            uint32_t relPosHPLength : 1;
            uint32_t accN : 1;
            uint32_t accE : 1;
            uint32_t accD : 1;
            uint32_t accLength : 1;
            uint32_t accHeading : 1;

            uint32_t gnssFixOK : 1;
            uint32_t diffSoln : 1;
            uint32_t relPosValid : 1;
            uint32_t carrSoln : 1;
            uint32_t isMoving : 1;
            uint32_t refPosMiss : 1;
            uint32_t refObsMiss : 1;
            uint32_t relPosHeadingValid : 1;
            uint32_t relPosNormalized : 1;
        } bits;
    } moduleQueried;
} UBX_NAV_RELPOSNED_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_NAV_RELPOSNED_data_t data;
    UBX_NAV_RELPOSNED_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_NAV_RELPOSNED_data_t *);
    UBX_NAV_RELPOSNED_data_t *callbackData;
} UBX_NAV_RELPOSNED_t;

// UBX-NAV-AOPSTATUS (0x01 0x60): AssistNow Autonomous status
const uint16_t UBX_NAV_AOPSTATUS_LEN = 16;

typedef struct
{
    uint32_t iTOW; // GPS time of week of the navigation epoch: ms
    union {
        uint8_t all;
        struct
        {
            uint8_t useAOP : 1; // AOP enabled flag
        } bits;
    } aopCfg;       // AssistNow Autonomous configuration
    uint8_t status; // AssistNow Autonomous subsystem is idle (0) or running (not 0)
    uint8_t reserved1[10];
} UBX_NAV_AOPSTATUS_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

            uint32_t iTOW : 1;

