WuCS-23to24/ESP32_Sensor_Node/include/u-blox_structs.h
    // The position of fecBits, ebno and reserved1 depends on the message version
    uint16_t fecBits;  // Number of bits corrected by FEC (forward error correction)
    uint8_t ebno;      // Energy per bit to noise power spectral density ratio : 2^-3 dB
    uint8_t reserved1; // Reserved

    uint8_t userData[UBX_RXM_PMP_MAX_USER_DATA]; // Received user data: version 0x00 : starts at byte 20 ; version 0x01
                                                 // : starts at byte 24

} UBX_RXM_PMP_data_t;

// The PMP data can only be accessed via a callback. PMP cannot be polled.
typedef struct
{
    ubxAutomaticFlags automaticFlags;
    void (*callbackPointerPtr)(UBX_RXM_PMP_data_t *);
    UBX_RXM_PMP_data_t *callbackData;
} UBX_RXM_PMP_t;

// Define a struct to hold the entire PMP message so the whole thing can be pushed to a GNSS.
// Remember that the length of the payload could be variable (with version 1 messages).
typedef struct
{
    uint8_t sync1; // 0xB5
    uint8_t sync2; // 0x62
    uint8_t cls;
    uint8_t ID;
    uint8_t lengthLSB;
    uint8_t lengthMSB;
    uint8_t payload[UBX_RXM_PMP_MAX_LEN];
    uint8_t checksumA;
    uint8_t checksumB;
} UBX_RXM_PMP_message_data_t;

// The PMP data can only be accessed via a callback. PMP cannot be polled.
typedef struct
{
    ubxAutomaticFlags automaticFlags;
    void (*callbackPointerPtr)(UBX_RXM_PMP_message_data_t *);
    UBX_RXM_PMP_message_data_t *callbackData;
} UBX_RXM_PMP_message_t;

// UBX-RXM-QZSSL6 (0x02 0x73): QZSS L6 raw data (D9C modules)
#define UBX_RXM_QZSSL6_NUM_CHANNELS 2
const uint16_t UBX_RXM_QZSSL6_DATALEN = 250;
const uint16_t UBX_RXM_QZSSL6_MAX_LEN = UBX_RXM_QZSSL6_DATALEN + 14;

typedef struct
{
    uint8_t version;      // Message version (0x00 / 0x01)
    uint8_t svId;         // Satellite identifier
    uint16_t cno;         // Mean C/N0
    uint32_t timeTag;     // Time since startup when frame started : ms
    uint8_t groupDelay;   // L6 group delay w.r.t. L2 on channel
    uint8_t bitErrCorr;   // Number of bit errors corrected by Reed-Solomon decoder
    uint16_t chInfo;      // Information about receiver channel associated with a received QZSS L6 message
    uint8_t reserved0[2]; // Reserved
    uint8_t msgBytes[UBX_RXM_QZSSL6_DATALEN]; // Bytes in a QZSS L6 message
} UBX_RXM_QZSSL6_data_t;

struct ubxQZSSL6AutomaticFlags
{
    union {
        uint8_t all;
        struct
        {
            uint8_t automatic : 1;       // Will this message be delivered and parsed "automatically" (without polling)
            uint8_t implicitUpdate : 1;  // Is the update triggered by accessing stale data (=true) or by a call to
                                         // checkUblox (=false)
            uint8_t addToFileBuffer : 1; // Should the raw UBX data be added to the file buffer?
            uint8_t callbackCopyValid
                : UBX_RXM_QZSSL6_NUM_CHANNELS; // Is the copies of the data structs used by the callback valid/fresh?
        } bits;
    } flags;
};

// Define a struct to hold the entire QZSSL6 message so the whole thing can be pushed to a GNSS.
// Remember that the length of the payload could be variable (with version 1 messages).
typedef struct
{
    uint8_t sync1; // 0xB5
    uint8_t sync2; // 0x62
    uint8_t cls;
    uint8_t ID;
    uint8_t lengthLSB;
    uint8_t lengthMSB;
    uint8_t payload[UBX_RXM_QZSSL6_MAX_LEN];
    uint8_t checksumA;
    uint8_t checksumB;
} UBX_RXM_QZSSL6_message_data_t;

// The QZSSL6 data can only be accessed via a callback. QZSSL6 cannot be polled.
typedef struct
{
    ubxQZSSL6AutomaticFlags automaticFlags;
    void (*callbackPointerPtr)(UBX_RXM_QZSSL6_message_data_t *);
    UBX_RXM_QZSSL6_message_data_t *callbackData;
} UBX_RXM_QZSSL6_message_t;

// CFG-specific structs - deleted at v3.0

// UBX-CFG-PRT (0x06 0x00): Port configuration
// UBX-CFG-RATE (0x06 0x08): Navigation/measurement rate settings
// UBX-CFG-TP5 (0x06 0x31): Time pulse parameters
// UBX-CFG-ITFM (0x06 0x39): Jamming/interference monitor configuration
// UBX-CFG-TMODE3 (0x06 0x71): Time Mode Settings 3

// MON-specific structs

// UBX-MON-HW (0x0A 0x09): Hardware status
const uint16_t UBX_MON_HW_LEN = 60;

typedef struct
{
    uint32_t pinSel;     // Mask of pins set as peripheral/PIO
    uint32_t pinBank;    // Mask of pins set as bank A/B
    uint32_t pinDir;     // Mask of pins set as input/output
    uint32_t pinVal;     // Mask of pins value low/high
    uint16_t noisePerMS; // Noise level as measured by the GPS core
    uint16_t agcCnt;     // AGC monitor (counts SIGHI xor SIGLO, range 0 to 8191)
    uint8_t aStatus;     // Status of the antenna supervisor state machine (0=INIT, 1=DONTKNOW, 2=OK, 3=SHORT, 4=OPEN)
    uint8_t aPower;      // Current power status of antenna (0=OFF, 1=ON, 2=DONTKNOW)
    union {
        uint8_t all;
        struct
        {
            uint8_t rtcCalib : 1;     // RTC is calibrated
            uint8_t safeBoot : 1;     // Safeboot mode (0 = inactive, 1 = active)
            uint8_t jammingState : 2; // Output from jamming/interference monitor (0 = unknown or feature disabled,
                                      // 1 = ok - no significant jamming,
                                      // 2 = warning - interference visible but fix OK,
                                      // 3 = critical - interference visible and no fix)
            uint8_t xtalAbsent : 1;   // RTC xtal has been determined to be absent
        } bits;
    } flags;
    uint8_t reserved1;    // Reserved
    uint32_t usedMask;    // Mask of pins that are used by the virtual pin manager
    uint8_t VP[17];       // Array of pin mappings for each of the 17 physical pins
    uint8_t jamInd;       // CW jamming indicator, scaled (0 = no CW jamming, 255 = strong CW jamming)
    uint8_t reserved2[2]; // Reserved
    uint32_t pinIrq;      // Mask of pins value using the PIO Irq
    uint32_t pullH;       // Mask of pins value using the PIO pull high resistor
    uint32_t pullL;       // Mask of pins value using the PIO pull low resistor
} UBX_MON_HW_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

