WuCS-23to24/ESP32_Sensor_Node/include/u-blox_structs.h
            uint32_t pinSel : 1;
            uint32_t pinBank : 1;
            uint32_t pinDir : 1;
            uint32_t pinVal : 1;
            uint32_t noisePerMS : 1;
            uint32_t agcCnt : 1;
            uint32_t aStatus : 1;
            uint32_t aPower : 1;

            uint32_t rtcCalib : 1;
            uint32_t safeBoot : 1;
            uint32_t jammingState : 1;
            uint32_t xtalAbsent : 1;

            uint32_t usedMask : 1;
            uint32_t VP : 1;
            uint32_t jamInd : 1;
            uint32_t pinIrq : 1;
            uint32_t pullH : 1;
            uint32_t pinL : 1;
        } bits;
    } moduleQueried;
} UBX_MON_HW_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_MON_HW_data_t data;
    UBX_MON_HW_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_MON_HW_data_t *);
    UBX_MON_HW_data_t *callbackData;
} UBX_MON_HW_t;

// UBX-MON-HW2 (0x0A 0x0B): Extended hardware status
const uint16_t UBX_MON_HW2_LEN = 28;

typedef struct
{
    int8_t ofsI;  // Imbalance of I-part of complex signal, scaled (-128 = max. negative imbalance, 127 = max. positive
                  // imbalance)
    uint8_t magI; // Magnitude of I-part of complex signal, scaled (0 = no signal, 255 = max. magnitude)
    int8_t ofsQ;  // Imbalance of Q-part of complex signal, scaled (-128 = max. negative imbalance, 127 = max. positive
                  // imbalance)
    uint8_t magQ; // Magnitude of Q-part of complex signal, scaled (0 = no signal, 255 = max. magnitude)
    uint8_t cfgSource; // Source of low-level configuration (114 = ROM, 111 = OTP, 112 = config pins, 102 = flash image)
    uint8_t reserved0[3];
    uint32_t lowLevCfg; // Low-level configuration (obsolete for protocol versions greater than 15.00)
    uint8_t reserved1[8];
    uint32_t postStatus;  // POST status word
    uint8_t reserved2[4]; // Reserved
} UBX_MON_HW2_data_t;

// UBX-MON-RF (0x0a 0x38): RF information
const uint16_t UBX_MON_RF_MAX_BLOCKS = 2; // 0 = L1; 1 = L2 / L5
const uint16_t UBX_MON_RF_MAX_LEN = 4 + (24 * UBX_MON_RF_MAX_BLOCKS);

typedef struct
{
    uint8_t version; // Message version (0x00 for this version)
    uint8_t nBlocks; // The number of RF blocks included
    uint8_t reserved0[2];
} UBX_MON_RF_header_t;

typedef struct
{
    uint8_t blockId; // RF block ID (0 = L1 band, 1 = L2 or L5 band depending on product configuration)
    union {
        uint8_t all;
        struct
        {
            uint8_t jammingState : 2; // output from Jamming/Interference Monitor (0 = unknown or feature disabled,
                                      // 1 = ok - no significant jamming,
                                      // 2 = warning - interference visible but fix OK,
                                      // 3 = critical - interference visible and no fix)
        } bits;
    } flags;
    uint8_t antStatus; // Status of the antenna supervisor state machine (0x00=INIT, 0x01=DONTKNOW, 0x02=OK, 0x03=SHORT,
                       // 0x04=OPEN)
    uint8_t antPower;  // Current power status of antenna (0x00=OFF, 0x01=ON, 0x02=DONTKNOW)
    uint32_t postStatus;  // POST status word
    uint8_t reserved1[4]; // Reserved
    uint16_t noisePerMS;  // Noise level as measured by the GPS core
    uint16_t agcCnt;      // AGC Monitor (counts SIGHI xor SIGLO, range 0 to 8191)
    uint8_t jamInd;       // CW jamming indicator, scaled (0=no CW jamming, 255 = strong CW jamming)
    int8_t ofsI;  // Imbalance of I-part of complex signal, scaled (-128 = max. negative imbalance, 127 = max. positive
                  // imbalance)
    uint8_t magI; // Magnitude of I-part of complex signal, scaled (0 = no signal, 255 = max.magnitude)
    int8_t ofsQ;  // Imbalance of Q-part of complex signal, scaled (-128 = max. negative imbalance, 127 = max. positive
                  // imbalance)
    uint8_t magQ; // Magnitude of Q-part of complex signal, scaled (0 = no signal, 255 = max.magnitude)
    uint8_t reserved2[3]; // Reserved
} UBX_MON_RF_block_t;

typedef struct
{
    UBX_MON_RF_header_t header;
    UBX_MON_RF_block_t blocks[UBX_MON_RF_MAX_BLOCKS];
} UBX_MON_RF_data_t;

// TIM-specific structs

// UBX-TIM-TM2 (0x0D 0x03): Time mark data
const uint16_t UBX_TIM_TM2_LEN = 28;

typedef struct
{
    uint8_t ch; // Channel (i.e. EXTINT) upon which the pulse was measured
    union {
        uint8_t all;
        struct
        {
            uint8_t mode : 1;           // 0=single; 1=running
            uint8_t run : 1;            // 0=armed; 1=stopped
            uint8_t newFallingEdge : 1; // New falling edge detected
            uint8_t timeBase : 2;       // 0=Time base is Receiver time; 1=Time base is GNSS time; 2=Time base is UTC
            uint8_t utc : 1;            // 0=UTC not available; 1=UTC available
            uint8_t time : 1;           // 0=Time is not valid; 1=Time is valid (Valid GNSS fix)
            uint8_t newRisingEdge : 1;  // New rising edge detected
        } bits;
    } flags;
    uint16_t count;     // Rising edge counter
    uint16_t wnR;       // Week number of last rising edge
    uint16_t wnF;       // Week number of last falling edge
    uint32_t towMsR;    // TOW of rising edge: ms
    uint32_t towSubMsR; // Millisecond fraction of tow of rising edge: ns
    uint32_t towMsF;    // TOW of falling edge: ms
    uint32_t towSubMsF; // Millisecond fraction of tow of falling edge: ns
    uint32_t accEst;    // Accuracy estimate: ns
} UBX_TIM_TM2_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

            uint32_t ch : 1;
            uint32_t mode : 1;
            uint32_t run : 1;
            uint32_t newFallingEdge : 1;
            uint32_t timeBase : 1;
            uint32_t utc : 1;
            uint32_t time : 1;
            uint32_t newRisingEdge : 1;

            uint32_t count : 1;
            uint32_t wnR : 1;
            uint32_t wnF : 1;
            uint32_t towMsR : 1;
            uint32_t towSubMsR : 1;
            uint32_t towMsF : 1;
            uint32_t towSubMsF : 1;
            uint32_t accEst : 1;
        } bits;
    } moduleQueried;
} UBX_TIM_TM2_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_TIM_TM2_data_t data;
    UBX_TIM_TM2_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_TIM_TM2_data_t *);
    UBX_TIM_TM2_data_t *callbackData;
} UBX_TIM_TM2_t;

// UBX-TIM-TP (0x0D 0x01): Time pulse time data
// Contains the Time-Pulse-Of-Week for the _next_ time pulse
// (PVT provides the time of the navigation solution which is usually
// aligned with the _previous_ pulse)
const uint16_t UBX_TIM_TP_LEN = 16;

typedef struct
{
    uint32_t towMS;    // Time pulse time of week according to time base : ms
    uint32_t towSubMS; // Submillisecond part of towMS : ms * 2^-32
    int32_t qErr;      // Quantization error of time pulse : ps
    uint16_t week;     // Time pulse week number according to time base : weeks
    union {
        uint8_t all;
        struct
        {
            uint8_t timeBase : 1;    // 0=GNSS; 1=UTC
            uint8_t utc : 1;         // 0=UTC not available; 1=UTC available
            uint8_t raim : 2;        // 0=RAIM information not available; 1=RAIM not active; 2=RAIM Active
            uint8_t qErrInvalid : 1; // 0=Quantization error invalid; 1=valid
        } bits;
    } flags;
    union {
        uint8_t all;
        struct
        {
            uint8_t timeRefGnss : 4; // GNSS Reference: 0=GPS; 1=GLONASS; 2=BeiDou; 3=Galileo; 4=NavIC; 15=Unknown
            uint8_t utcStandard : 4; // UTC Standard ID - if timeBase = 1: 0=not available; 1=CRL; 2=NIST; 3=USNO;
                                     // 4=BIPM; 5=Eu; 6=SU; 7=NTSC; 8=NPLI; 15=Unknown
        } bits;
    } refInfo;
} UBX_TIM_TP_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

