WuCS-23to24/ESP32_Sensor_Node/include/u-blox_structs.h
            uint32_t towMS : 1;
            uint32_t towSubMS : 1;
            uint32_t qErr : 1;
            uint32_t week : 1;

            uint32_t timeBase : 1;
            uint32_t utc : 1;
            uint32_t raim : 1;
            uint32_t qErrInvalid : 1;

            uint32_t timeRefGnss : 1;
            uint32_t utcStandard : 1;
        } bits;
    } moduleQueried;
} UBX_TIM_TP_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_TIM_TP_data_t data;
    UBX_TIM_TP_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_TIM_TP_data_t *);
    UBX_TIM_TP_data_t *callbackData;
} UBX_TIM_TP_t;

// SEC-specific structs

// UBX-SEC-UNIQID (0x27 0x03): Unique chip ID
// The ID is five bytes on the F9 and M9 (version 1) but six bytes on the M10 (version 2)
const uint16_t UBX_SEC_UNIQID_LEN_VERSION1 = 9;
const uint16_t UBX_SEC_UNIQID_LEN_VERSION2 = 10;

typedef struct
{
    uint8_t version;
    uint8_t reserved0[3];
    uint8_t uniqueId[6];
} UBX_SEC_UNIQID_data_t;

// ESF-specific structs

// UBX-ESF-ALG (0x10 0x14): IMU alignment information
const uint16_t UBX_ESF_ALG_LEN = 16;

typedef struct
{
    uint32_t iTOW;   // GPS time of week of the HNR epoch: ms
    uint8_t version; // Message version (0x01 for this version)
    union {
        uint8_t all;
        struct
        {
            uint8_t autoMntAlgOn : 1; // Automatic IMU-mount alignment on/off bit
            uint8_t status : 3;       // Status of the IMU-mount alignment
                                      //   0: user-defined/fixed angles are used
                                      //   1: IMU-mount roll/pitch angles alignment is ongoing
                                      //   2: IMU-mount roll/pitch/yaw angles alignment is ongoing
                                      //   3: coarse IMU-mount alignment are used
                                      //   4: fine IMU-mount alignment are used
        } bits;
    } flags;
    union {
        uint8_t all;
        struct
        {
            uint8_t tiltAlgError : 1; // IMU-mount tilt (roll and/or pitch) alignment error (0: no error, 1: error)
            uint8_t yawAlgError : 1;  // IMU-mount yaw alignment error (0: no error, 1: error)
            uint8_t angleError : 1;   // IMU-mount misalignment Euler angle singularity error (0: no error, 1: error)
        } bits;
    } error;
    uint8_t reserved1;
    uint32_t yaw;  // IMU-mount yaw angle [0, 360]: Degrees * 1e-2
    int16_t pitch; // IMU-mount pitch angle [-90, 90]: Degrees * 1e-2
    int16_t roll;  // IMU-mount roll angle [-180, 180]: Degrees * 1e-2
} UBX_ESF_ALG_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

            uint32_t iTOW : 1;
            uint32_t version : 1;

            uint32_t autoMntAlgOn : 1;
            uint32_t status : 1;

            uint32_t tiltAlgError : 1;
            uint32_t yawAlgError : 1;
            uint32_t angleError : 1;

            uint32_t yaw : 1;
            uint32_t pitch : 1;
            uint32_t roll : 1;
        } bits;
    } moduleQueried;
} UBX_ESF_ALG_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_ESF_ALG_data_t data;
    UBX_ESF_ALG_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_ESF_ALG_data_t *);
    UBX_ESF_ALG_data_t *callbackData;
} UBX_ESF_ALG_t;

// UBX-ESF-INS (0x10 0x15): Vehicle dynamics information
const uint16_t UBX_ESF_INS_LEN = 36;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t version : 8;       // Message version (0x01 for this version)
            uint32_t xAngRateValid : 1; // Compensated x-axis angular rate data validity flag (0: not valid, 1: valid)
            uint32_t yAngRateValid : 1; // Compensated y-axis angular rate data validity flag (0: not valid, 1: valid)
            uint32_t zAngRateValid : 1; // Compensated z-axis angular rate data validity flag (0: not valid, 1: valid)
            uint32_t xAccelValid : 1;   // Compensated x-axis acceleration data validity flag (0: not valid, 1: valid)
            uint32_t yAccelValid : 1;   // Compensated y-axis acceleration data validity flag (0: not valid, 1: valid)
            uint32_t zAccelValid : 1;   // Compensated z-axis acceleration data validity flag (0: not valid, 1: valid)
        } bits;
    } bitfield0;
    uint8_t reserved1[4];
    uint32_t iTOW;    // GPS time of week of the HNR epoch: ms
    int32_t xAngRate; // Compensated x-axis angular rate: Degrees/s * 1e-3
    int32_t yAngRate; // Compensated y-axis angular rate: Degrees/s * 1e-3
    int32_t zAngRate; // Compensated z-axis angular rate: Degrees/s * 1e-3
    int32_t xAccel;   // Compensated x-axis acceleration (gravity-free): m/s^2 * 1e-2
    int32_t yAccel;   // Compensated y-axis acceleration (gravity-free): m/s^2 * 1e-2
    int32_t zAccel;   // Compensated z-axis acceleration (gravity-free): m/s^2 * 1e-2
} UBX_ESF_INS_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

            uint32_t version : 1;
            uint32_t xAngRateValid : 1;
            uint32_t yAngRateValid : 1;
            uint32_t zAngRateValid : 1;
            uint32_t xAccelValid : 1;
            uint32_t yAccelValid : 1;
            uint32_t zAccelValid : 1;

            uint32_t iTOW : 1;
            uint32_t xAngRate : 1;
            uint32_t yAngRate : 1;
            uint32_t zAngRate : 1;
            uint32_t xAccel : 1;
            uint32_t yAccel : 1;
            uint32_t zAccel : 1;
        } bits;
    } moduleQueried;
} UBX_ESF_INS_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_ESF_INS_data_t data;
    UBX_ESF_INS_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_ESF_INS_data_t *);
    UBX_ESF_INS_data_t *callbackData;
} UBX_ESF_INS_t;

// UBX-ESF-MEAS (0x10 0x02): External sensor fusion measurements
// Note: length is variable
// Note: ESF RAW data cannot be polled. It is "Output" only
#define UBX_ESF_MEAS_CALLBACK_BUFFERS 6
const uint16_t UBX_ESF_MEAS_MAX_LEN = 8 + (4 * DEF_MAX_NUM_ESF_MEAS) + 4;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t dataField : 24; // Data
            uint32_t dataType : 6;   // Type of data (0 = no data; 1..63 = data type)
        } bits;
    } data;
} UBX_ESF_MEAS_sensorData_t;

typedef struct
{
    uint32_t timeTag; // Time tag of measurement generated by external sensor
    union {
        uint16_t all;
        struct
        {
            uint16_t timeMarkSent : 2;   // Time mark signal was supplied just prior to sending this message:
                                         //   0 = none, 1 = on Ext0, 2 = on Ext1
            uint16_t timeMarkEdge : 1;   // Trigger on rising (0) or falling (1) edge of time mark signal
            uint16_t calibTtagValid : 1; // Calibration time tag available. Always set to zero.
            uint16_t reserved : 7;
            uint16_t numMeas : 5; // Number of measurements contained in this message (optional, can be obtained from
                                  // message size)
        } bits;
    } flags;
    uint16_t id; // Identification number of data provider
    UBX_ESF_MEAS_sensorData_t data[DEF_MAX_NUM_ESF_MEAS];
    uint32_t calibTtag; // OPTIONAL: Receiver local time calibrated: ms
} UBX_ESF_MEAS_data_t;

struct ubxESFMEASAutomaticFlags
{
    union {
        uint16_t all;
        struct
        {
            uint16_t automatic : 1;       // Will this message be delivered and parsed "automatically" (without polling)
            uint16_t implicitUpdate : 1;  // Is the update triggered by accessing stale data (=true) or by a call to
                                          // checkUblox (=false)
            uint16_t addToFileBuffer : 1; // Should the raw UBX data be added to the file buffer?
            uint16_t callbackCopyValid
                : UBX_ESF_MEAS_CALLBACK_BUFFERS; // Are the copies of the data struct used by the callback valid/fresh?
        } bits;
    } flags;
};

typedef struct
{
    ubxESFMEASAutomaticFlags automaticFlags;
    UBX_ESF_MEAS_data_t data;
    void (*callbackPointerPtr)(UBX_ESF_MEAS_data_t *);
    UBX_ESF_MEAS_data_t *callbackData; // This is an array of buffers
} UBX_ESF_MEAS_t;

// UBX-ESF-RAW (0x10 0x03): Raw sensor measurements
// Note: length is variable
// Note: The ZED-F9R sends sets of seven sensor readings one at a time
//       But the NEO-M8U sends them in sets of ten (i.e. seventy readings per message)
// Note: ESF RAW data cannot be polled. It is "Output" only
const uint16_t UBX_ESF_RAW_MAX_LEN = 4 + (8 * DEF_NUM_SENS * DEF_MAX_NUM_ESF_RAW_REPEATS);

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t dataField : 24; // Data
            uint32_t dataType : 8;   // Type of data (0 = no data; 1..255 = data type)
        } bits;
    } data;
    uint32_t sTag; // Sensor time tag
} UBX_ESF_RAW_sensorData_t;

typedef struct
{
    uint8_t reserved1[4];
    UBX_ESF_RAW_sensorData_t data[DEF_NUM_SENS * DEF_MAX_NUM_ESF_RAW_REPEATS];
    uint8_t numEsfRawBlocks; // Note: this is not contained in the ESF RAW message. It is calculated from the message
                             // length.
} UBX_ESF_RAW_data_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_ESF_RAW_data_t data;
    void (*callbackPointerPtr)(UBX_ESF_RAW_data_t *);
    UBX_ESF_RAW_data_t *callbackData;
} UBX_ESF_RAW_t;

// UBX-ESF-STATUS (0x10 0x10): External sensor fusion status
// Note: length is variable
const uint16_t UBX_ESF_STATUS_MAX_LEN = 16 + (4 * DEF_NUM_SENS);

typedef struct
{
    union {
        uint8_t all;
        struct
        {
            uint8_t type : 6;  // Sensor data type
            uint8_t used : 1;  // If set, sensor data is used for the current sensor fusion solution
            uint8_t ready : 1; // If set, sensor is set up (configuration is available or not required) but not used for
                               // computing the current sensor fusion solution.
        } bits;
    } sensStatus1;
    union {
        uint8_t all;
        struct
        {
            uint8_t calibStatus : 2; // 00: Sensor is not calibrated
                                     // 01: Sensor is calibrating
                                     // 10/11: Sensor is calibrated
            uint8_t timeStatus : 2;  // 00: No data
                                     // 01: Reception of the first byte used to tag the measurement
                                     // 10: Event input used to tag the measurement
                                     // 11: Time tag provided with the data
        } bits;
    } sensStatus2;
    uint8_t freq; // Observation frequency: Hz
    union {
        uint8_t all;
        struct
        {
            uint8_t badMeas : 1;     // Bad measurements detected
            uint8_t badTTag : 1;     // Bad measurement time-tags detected
            uint8_t missingMeas : 1; // Missing or time-misaligned measurements detected
            uint8_t noisyMeas : 1;   // High measurement noise-level detected
        } bits;
    } faults;
} UBX_ESF_STATUS_sensorStatus_t;

typedef struct
{
    uint32_t iTOW;   // GPS time of week of the HNR epoch: ms
    uint8_t version; // Message version (0x02 for this version)
    uint8_t reserved1[7];
    uint8_t fusionMode; // Fusion mode:
                        //  0: Initialization mode: receiver is initializing some unknown values required for doing
                        //  sensor fusion 1: Fusion mode: GNSS and sensor data are used for navigation solution
                        //  computation 2: Suspended fusion mode: sensor fusion is temporarily disabled due to e.g.
                        //  invalid sensor data or detected ferry 3: Disabled fusion mode: sensor fusion is permanently
                        //  disabled until receiver reset due e.g. to sensor error
    uint8_t reserved2[2];
    uint8_t numSens; // Number of sensors
    UBX_ESF_STATUS_sensorStatus_t status[DEF_NUM_SENS];
} UBX_ESF_STATUS_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

            uint32_t iTOW : 1;
            uint32_t version : 1;
            uint32_t fusionMode : 1;
            uint32_t numSens : 1;

            uint32_t status : DEF_NUM_SENS;
        } bits;
    } moduleQueried;
} UBX_ESF_STATUS_moduleQueried_t;

typedef struct
{
    ubxAutomaticFlags automaticFlags;
    UBX_ESF_STATUS_data_t data;
    UBX_ESF_STATUS_moduleQueried_t moduleQueried;
    void (*callbackPointerPtr)(UBX_ESF_STATUS_data_t *);
    UBX_ESF_STATUS_data_t *callbackData;
} UBX_ESF_STATUS_t;

// MGA-specific structs

// UBX-MGA-ACK-DATA0 (0x13 0x60): Multiple GNSS acknowledge message
const uint16_t UBX_MGA_ACK_DATA0_LEN = 8;

typedef struct
{
    uint8_t type;     // Type of acknowledgment:
                      // 0: The message was not used by the receiver (see infoCode field for an indication of why)
                      // 1: The message was accepted for use by the receiver (the infoCode field will be 0)
    uint8_t version;  // Message version
    uint8_t infoCode; // Provides greater information on what the receiver chose to do with the message contents
                      // See sfe_ublox_mga_ack_infocode_e
    uint8_t msgId;    // UBX message ID of the acknowledged message
    uint8_t msgPayloadStart[4]; // The first 4 bytes of the acknowledged message's payload
} UBX_MGA_ACK_DATA0_data_t;

#define UBX_MGA_ACK_DATA0_RINGBUFFER_LEN 16 // Provide storage for 16 MGA ACK packets
typedef struct
{
    uint8_t head;
    uint8_t tail;
    UBX_MGA_ACK_DATA0_data_t data[UBX_MGA_ACK_DATA0_RINGBUFFER_LEN]; // Create a storage array for the MGA ACK packets
} UBX_MGA_ACK_DATA0_t;

// UBX-MGA-DBD (0x13 0x80): Navigation database dump entry
const uint16_t UBX_MGA_DBD_LEN = 164; // "The maximum payload size for firmware 2.01 onwards is 164 bytes"

typedef struct
{
    uint8_t dbdEntryHeader1; // We need to save the entire message - header, payload and checksum
    uint8_t dbdEntryHeader2;
    uint8_t dbdEntryClass;
    uint8_t dbdEntryID;
    uint8_t
        dbdEntryLenLSB; // We need to store the length of the DBD entry. The entry itself does not contain a length...
    uint8_t dbdEntryLenMSB;
    uint8_t dbdEntry[UBX_MGA_DBD_LEN];
    uint8_t dbdEntryChecksumA;
    uint8_t dbdEntryChecksumB;
} UBX_MGA_DBD_data_t;

#if defined(ARDUINO_ARCH_AVR) || defined(ARDUINO_ARCH_MEGAAVR)
#define UBX_MGA_DBD_RINGBUFFER_LEN                                                                                     \
    190 // Fix to let the code compile on AVR platforms - including the UNO and DxCore (DA/DB).
#else
#define UBX_MGA_DBD_RINGBUFFER_LEN                                                                                     \
    250 // Provide storage for MGA DBD packets. TO DO: confirm if 250 is large enough for all modules!
#endif

typedef struct
{
    uint8_t head;
    uint8_t tail;
    UBX_MGA_DBD_data_t data[UBX_MGA_DBD_RINGBUFFER_LEN]; // Create a storage array for the MGA DBD packets
} UBX_MGA_DBD_t;

// HNR-specific structs

// UBX-HNR-PVT (0x28 0x00): High rate output of PVT solution
const uint16_t UBX_HNR_PVT_LEN = 72;

typedef struct
{
    uint32_t iTOW; // GPS time of week of the HNR epoch: ms
    uint16_t year; // Year (UTC)
    uint8_t month; // Month, range 1..12 (UTC)
    uint8_t day;   // Day of month, range 1..31 (UTC)
    uint8_t hour;  // Hour of day, range 0..23 (UTC)
    uint8_t min;   // Minute of hour, range 0..59 (UTC)
    uint8_t sec;   // Seconds of minute, range 0..60 (UTC)
    union {
        uint8_t all;
        struct
        {
            uint8_t validDate : 1;     // 1 = Valid UTC Date
            uint8_t validTime : 1;     // 1 = Valid UTC Time of Day
            uint8_t fullyResolved : 1; // 1 = UTC Time of Day has been fully resolved
        } bits;
    } valid;
    int32_t nano;   // Fraction of second (UTC): ns
    uint8_t gpsFix; // GPSfix Type, range 0..5
                    // 0x00 = No Fix
                    // 0x01 = Dead Reckoning only
                    // 0x02 = 2D-Fix
                    // 0x03 = 3D-Fix
                    // 0x04 = GPS + dead reckoning combined
                    // 0x05 = Time only fix
                    // 0x06..0xff: reserved
    union {
        uint8_t all;
        struct
        {
            uint8_t gpsFixOK : 1;     // >1 = Fix within limits (e.g. DOP & accuracy)
            uint8_t diffSoln : 1;     // 1 = DGPS used
            uint8_t WKNSET : 1;       // 1 = Valid GPS week number
            uint8_t TOWSET : 1;       // 1 = Valid GPS time of week (iTOW & fTOW)
            uint8_t headVehValid : 1; // 1= Heading of vehicle is valid
        } bits;
    } flags;
    uint8_t reserved1[2];
    int32_t lon;      // Longitude: Degrees * 1e-7
    int32_t lat;      // Latitude: Degrees * 1e-7
    int32_t height;   // Height above ellipsoid: mm
    int32_t hMSL;     // Height above MSL: mm
    int32_t gSpeed;   // Ground Speed (2-D): mm/s
    int32_t speed;    // Speed (3-D): mm/s
    int32_t headMot;  // Heading of motion (2-D): Degrees * 1e-5
    int32_t headVeh;  // Heading of vehicle (2-D): Degrees * 1e-5
    uint32_t hAcc;    // Horizontal accuracy: mm
    uint32_t vAcc;    // Vertical accuracy: mm
    uint32_t sAcc;    // Speed accuracy: mm/s
    uint32_t headAcc; // Heading accuracy: Degrees * 1e-5
    uint8_t reserved2[4];
} UBX_HNR_PVT_data_t;

typedef struct
{
    union {
        uint32_t all;
        struct
        {
            uint32_t all : 1;

            uint32_t iTOW : 1;
            uint32_t year : 1;
            uint32_t month : 1;
            uint32_t day : 1;
            uint32_t hour : 1;
            uint32_t min : 1;
            uint32_t sec : 1;

            uint32_t validDate : 1;
            uint32_t validTime : 1;
            uint32_t fullyResolved : 1;

            uint32_t nano : 1;
            uint32_t gpsFix : 1;

